{
  "jokes": [
    {
      "joke": "The Talking Dog for Sale:\n
A man sees a sign in front of a house: \"Talking Dog for Sale.\" Curious, he rings the bell, and the owner directs him to the backyard where the dog is sitting.\n
\"So, you can talk?\" the man asks.\n
\"Yep,\" the dog replies.\n
\"That's amazing! Tell me your story.\"\n
The dog says, \"Well, I discovered my gift of talking as a pup and wanted to serve my country. I worked for the CIA as a top-secret spy. I traveled the world, eavesdropping on conversations, and helped catch bad guys. When I got older, I decided to settle down and became a therapy dog at a hospital. And now I’m retired.\"\n
The man is stunned. He returns to the owner and asks, \"How much for the dog?\"\n
\"Ten dollars.\"\n
\"Only ten dollars? Why so cheap?\"\n
The owner shrugs and says, \"He's a liar. He didn’t do any of that stuff.\"
	  "
    },
    {
      "joke": "The Parrot with a Secret\n
A woman buys a parrot from a pet store. The store owner warns her, \"This parrot used to live in a house of ill repute, so he might say some inappropriate things.\"\n
Excited, the woman takes the parrot home and places him in his cage.\n
The parrot looks around and says, \"New house, new madam.\"\n
Shocked but amused, the woman laughs it off.\n
Later, her two daughters come home, and the parrot exclaims, \"New girls! Hi, ladies!\"\n
Before the woman can react, her husband walks through the door, and the parrot squawks, \"Hi, Larry!\"
	  "
    },
    {
       "joke": "The Cow and the Farmer \n
A city slicker visits a farm and notices a cow with a wooden leg. Curious, he asks the farmer, \"Why does that cow have a wooden leg?\"\n
The farmer replies, \"That’s Bessie, the most amazing cow! Last year, she saved my son from drowning. And last month, she alerted us to a fire in the barn.\"\n
\"Wow, that’s incredible!\" the visitor says. \"But what does that have to do with her wooden leg?\"\n
The farmer grins and says, \"Well, when you have a cow that special, you don’t eat her all at once.\"\n
	  
	  "
    },
    {
       "joke": "The Clever Cat \n
A man walks into a bar with his cat. He orders a drink, and the cat hops onto the counter and starts talking to the bartender. Everyone is amazed.\n
\"How did you teach your cat to talk?\" someone asks.\n
The man replies, \"Oh, we just spend a lot of time together. He picked it up.\"\n
The cat interrupts, \"Don't believe him. I learned it from watching YouTube.\"\n
	  
	  "
    },
    {
       "joke": "The Owl’s Wisdom \n
A young bird asks an old owl, \"Why do humans think you're so wise?\"\n
The owl replies, \"It's because I always listen before I speak.\"\n
\"That's it?\" asks the bird.\n
\"Well,\" says the owl, \"that and the glasses.\"\n
	  
	  "
    },
    {
       "joke": "The Racing Snail \n
A man buys a snail for a pet and decides to remove its shell to make it faster. The snail moves even slower than before.\n
Confused, the man says, \"What's wrong?\"\n
The snail replies, \"I feel a little sluggish.\"\n
	  
	  "
    },
    {
       "joke": "The Lost Dog \n
A man walks into a bar with a worried expression. He says, \"Has anyone seen my dog? He's blind in one eye, missing a leg, and answers to the name 'Lucky.'\"\n
The bartender chuckles, \"With all that, how's he lucky?\"\n
\"Because,\" the man replies, \"he found his way home from three towns over last time!\"\n
	  
	  "
    },
    {
       "joke": "The Frog in the Library \n
A frog hops into a library and says, \"Read it! Read it!\"\n
The librarian gives the frog a book, and it hops away. The next day, the frog comes back and says, \"Read it! Read it!\"\n
This goes on for a week until the librarian decides to follow the frog. She sees it give the book to a large pond full of frogs, who all croak, \"Read it! Read it!\"\n
	  
	  "
    },
    {
       "joke": "The Talking Horse \n
A man finds a talking horse for sale. The horse says, \"I can talk, and I've lived an amazing life. I was a racehorse, won trophies, and later became a therapy horse.\"\n
The man says to the owner, \"Why are you selling him for only $50?\"\n
The owner says, \"Because he's lying. He's never even left the barn.\"\n
	  
	  "
    },
    {
       "joke": "The Penguin’s Adventure \n
A penguin drives his car to the mechanic and goes to a nearby ice cream shop while waiting. He orders a big sundae, but because he has flippers, he gets ice cream all over his face.\n
When he returns to the mechanic, the mechanic says, \"It looks like you blew a seal.\"\n
The penguin wipes his face and says, \"No, it's just ice cream.\"\n
	  
	  "
    },
    {
      "joke": "Bees love compliments; it’s all about the buzz."
    },
    {
      "joke": "Snails avoid escalators—they don’t need the speed."
    },
    {
      "joke": "Peacocks strut their stuff with no need for applause."
    },
    {
      "joke": "Goats can handle anything—they’re the G.O.A.T."
    },
    {
      "joke": "Rabbits excel at math; they multiply like pros."
    },
    {
      "joke": "Hedgehogs make great comedians; they deliver the point."
    },
    {
      "joke": "Camels survive the desert with their hump-lifting humor."
    },
    {
      "joke": "Ducks stay calm in storms; they let it roll off their backs."
    },
    {
      "joke": "Elephants keep their friends close with trunk calls."
    },
    {
      "joke": "Frogs leap into conversations with riveting remarks."
    },
    {
      "joke": "Giraffes have tall tales that reach new heights."
    },
    {
      "joke": "Monkeys swing into action with banana-themed jokes."
    },
    {
      "joke": "Lions deliver roaring good laughs in the jungle."
    },
    {
      "joke": "Hippos are always hip to the latest trends."
    },
    {
      "joke": "Foxes stay sharp with clever comebacks."
    },
    {
      "joke": "Whales sing tunes that make waves."
    },
    {
      "joke": "Sharks prefer their jokes with a biting edge."
    },
    {
      "joke": "Seahorses keep their humor briny but heartfelt."
    },
    {
      "joke": "Ants love teamwork jokes that stick together."
    },
    {
      "joke": "Penguins waddle into punchlines with perfect timing."
    },
    {
      "joke": "Deer stay grounded with earthy humor."
    },
    {
      "joke": "Crows stay smart by cracking corvid puzzles."
    },
    {
      "joke": "Wolves howl with laughter during full-moon parties."
    },
    {
      "joke": "Otters always make waves in comedy circles."
    },
    {
      "joke": "Raccoons love trash talk but keep it lighthearted."
    },
    {
      "joke": "Dolphins find puns simply fin-tastic."
    },
    {
      "joke": "Pandas keep it black and white with straightforward humor."
    },
    {
      "joke": "Moose tell tall tales that make everyone antler up."
    },
    {
      "joke": "Llamas spit out jokes that stick with you."
    },
    {
      "joke": "Horses stay stable with their wit."
    },
    {
      "joke": "Geese honk out their punchlines."
    },
    {
      "joke": "Coyotes always have a wild laugh ready."
    },
    {
      "joke": "Owls never miss a hoot-worthy joke."
    },
    {
      "joke": "Squirrels go nuts over acorny jokes."
    },
    {
      "joke": "Tigers keep their humor fierce and striped."
    },
    {
      "joke": "Porcupines have prickly punchlines but soft delivery."
    },
    {
      "joke": "Cheetahs race to the punchline without cheating."
    },
    {
      "joke": "Snakes slither in with hiss-terical humor."
    },
    {
      "joke": "Flies keep buzzing with short and snappy jokes."
    },
    {
      "joke": "Donkeys love braying out their jokes."
    },
    {
      "joke": "Butterflies keep it light and fluttery in comedy."
    },
    {
      "joke": "Koalas stay calm with eucalyptus-infused humor."
    },
    {
      "joke": "Crickets chirp in delight at subtle puns."
    },
    {
      "joke": "Turkeys gobble up the best jokes at Thanksgiving."
    },
    {
      "joke": "Ravens caw with delight at dark humor."
    },
    {
      "joke": "Eagles soar high with their sky-themed jokes."
    },
    {
      "joke": "Bears stay grizzly but funny in the wild."
    },
    {
      "joke": "Wombats keep it grounded with dry humor."
    },
    {
      "joke": "Pelicans dive deep into water puns."
    },
    {
      "joke": "Armadillos roll into punchlines with protective humor."
    },
    {
      "joke": "Seals clap for every joke, no matter the quality."
    },
    {
      "joke": "Storks deliver their jokes with impeccable timing."
    },
    {
      "joke": "Beavers work hard for their dam good jokes."
    },
    {
      "joke": "Mice squeak out tiny but effective puns."
    },
    {
      "joke": "Lobsters keep it snappy with their claws."
    },
    {
      "joke": "Flounders excel at flat jokes."
    },
    {
      "joke": "Chickens cross the road to punch up their material."
    },
    {
      "joke": "Jellyfish have tentacle-tingling humor."
    },
    {
      "joke": "Alpacas always pack a joke for every occasion."
    },
    {
      "joke": "Hamsters run circles around cheesy puns."
    },
    {
      "joke": "Zebras laugh in black-and-white stripes."
    },
    {
      "joke": "Eels electrify the crowd with their wit."
    },
    {
      "joke": "Walruses seal the deal with blubbery jokes."
    },
    {
      "joke": "Crabs sidestep serious jokes for silliness."
    },
    {
      "joke": "Chameleons blend into every comedic setting."
    },
    {
      "joke": "Fleas jump to conclusions in their punchlines."
    },
    {
      "joke": "Goats keep their comedy sturdy and horned."
    },
    {
      "joke": "Badgers dig deep for their best jokes."
    },
    {
      "joke": "Platypuses baffle everyone with their unique humor."
    },
    {
      "joke": "Rats squeak by with cheesy punchlines."
    },
    {
      "joke": "Slugs slide into humor slowly but surely."
    },
    {
      "joke": "Owls are real night owls in comedy clubs."
    },
    {
      "joke": "Caterpillars inch toward the perfect joke."
    },
    {
      "joke": "Gulls stay light with ocean-breeze humor."
    },
    {
      "joke": "Toads hop between puns and ribbits."
    },
    {
      "joke": "Peacocks preen their punchlines to perfection."
    }
  ]
}